10 REM ============================================
   REM ТРИ ТАЛИСМАНА
   REM ОСНОВА ИГРЫ
   REM ============================================

   STONE=0
   SWORD=0
   SHIELD=0
   TALISMAN=0



100 REM ============================================
    REM ПРОБУЖДЕНИЕ
    REM ============================================

    PAPER 0
    INK 255
    CLS

    PRINT AT 8,2;"RPG-КВЕСТ: Три Талисмана"
    PRINT AT 12,5;"КРАКОЗЕБРОЖАБОЛЮД"
    PRINT AT 15,7;"ПРОСНУЛСЯ!"

    PAUSE

    GOTO 1000


500 REM ============================================
    REM КОНЕЦ ИГРЫ - СМЕРТЬ
    REM ============================================

    PAPER 0
    INK 255
    CLS

    PRINT AT 8,10;"ВЫ ПОГИБЛИ"

    PRINT AT 4,15;"НАЧАТЬ ЗАНОВО"

    PAUSE

    STONE=0
    SWORD=0
    SHIELD=0
    TALISMAN=0

    GOTO 100


900 REM ============================================
    REM ВЫ ВСЁ ПРОСПАЛИ
    REM ============================================

    PAPER 0
    INK 255
    CLS

    PRINT AT 5,12;"ВЫ ВСЁ ПРОСПАЛИ!"

    PAUSE

    GOTO 100


1000 REM ============================================
     REM ЦЕНТРАЛЬНАЯ ПОЛЯНА
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 1,1;"ВЫ НА ПОЛЯНЕ В ЛЕСУ."

     PRINT AT 1,3;"ВИДНЫ ДРЕВНИЕ РУИНЫ"
     PRINT AT 1,5;"И СТРАННАЯ ПЕЩЕРА"
     PRINT AT 1,7;"С ЗАКОЛОЧЕННОЙ ДВЕРЬЮ"

     REM ДЕРЕВО СДВИНУТО ВЛЕВО

     INK 48

     PCIRCLE 35,110,20
     PCIRCLE 60,100,25
     PCIRCLE 80,115,20

     INK 192

     LINE 60,120,60,180

     REM ПЕЩЕРА

     INK 192

     LINE 220,180,235,120
     LINE 235,120,275,180

     REM РУИНЫ

     INK 255

     LINE 135,160,135,120
     LINE 135,120,165,120
     LINE 165,120,165,160

     REM ГЕРОЙ

     X=110
     Y=165

     GOSUB 10000


1100 REM ============================================
     REM МЕНЮ ПОЛЯНЫ
     REM ============================================

     INK 255

     PRINT AT 3,21;"ЛЕЧЬ СПАТЬ"
     PRINT AT 3,23;"ПОЙТИ К ПЕЩЕРЕ"
     PRINT AT 3,25;"ПОЙТИ В ЛЕС"
     PRINT AT 3,27;"ОСМОТРЕТЬ РУИНЫ"

     PAUSE

     Y=TOUCHY

     IF Y>=168 AND Y<184 THEN GOTO 900

     IF Y>=184 AND Y<200 THEN GOTO 2000

     IF Y>=200 AND Y<216 THEN GOTO 3000

     IF Y>=216 AND Y<232 THEN GOTO 4000

     GOTO 1000


2000 REM ============================================
     REM ПЕЩЕРА
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 1,1;"КАМЕННАЯ ПЕЩЕРА"

     REM ПЕЩЕРА

     INK 192

     LINE 40,180,70,80
     LINE 70,80,130,40
     LINE 130,40,200,80
     LINE 200,80,250,180
     LINE 40,180,250,180

     REM ДВЕРЬ

     INK 255

     LINE 115,180,115,100
     LINE 115,100,185,100
     LINE 185,100,185,180

     REM КАМЕНЬ

     IF STONE<>0 THEN GOTO 2100

     INK 192

     PCIRCLE 100,176,8


2100 REM ============================================
     REM ТЕКСТ ПЕЩЕРЫ
     REM ============================================

     INK 255

     IF SWORD THEN GOTO 2200

     PRINT AT 1,3;"ВЫ ВИДИТЕ ДВЕРЬ"
     PRINT AT 1,4;"И ЛЕЖАЩИЙ РЯДОМ КАМЕНЬ"

     GOTO 2300


2200 REM ============================================
     REM МЕЧ ПОЛУЧЕН
     REM ============================================

     PRINT AT 1,5;"ДВЕРЬ СЛОМАНА."
     PRINT AT 1,7;"МЕЧ У ВАС."


2300 REM ============================================
     REM МЕНЮ ПЕЩЕРЫ
     REM ============================================

     PRINT AT 2,24;"ВЕРНУТЬСЯ НА ПОЛЯНУ"
     PRINT AT 2,26;"ПРОВЕРИТЬ ДВЕРЬ"

     IF STONE=0 THEN PRINT AT 2,28;"ПОДНЯТЬ КАМЕНЬ"

     IF STONE=1 THEN PRINT AT 2,28;"УДАРИТЬ ДВЕРЬ"

     PAUSE

     Y=TOUCHY

     IF Y>=192 AND Y<208 THEN GOTO 1000

     IF Y>=208 AND Y<224 THEN GOTO 2400

     IF Y>=224 AND Y<240 THEN GOTO 2500

     GOTO 2000


2400 REM ============================================
     REM ПРОВЕРИТЬ ДВЕРЬ
     REM ============================================

     PAPER 0
     INK 255
     CLS

     IF SWORD THEN GOTO 2450

     PRINT AT 3,12;"ДВЕРЬ ЗАКОЛОЧЕНА"

     PAUSE

     GOTO 2000


2450 PRINT AT 3,12;"ДВЕРЬ СЛОМАНА"

     PAUSE

     GOTO 2000


2500 REM ============================================
     REM ДЕЙСТВИЕ С КАМНЕМ
     REM ============================================

     IF STONE=0 THEN GOTO 2550

     IF STONE=1 THEN GOTO 2600

     PAPER 0
     INK 255
     CLS

     PRINT AT 3,12;"ВАМ НЕЧЕМ УДАРИТЬ"

     PAUSE

     GOTO 2000


2550 STONE=1

     GOTO 2000


2600 REM ============================================
     REM РАЗБИТЬ ДВЕРЬ
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 1,1;"КАМЕННАЯ ПЕЩЕРА"

     PRINT AT 4,10;"ГРОХОТ!"

     PRINT AT 3,13;"ВОРОТА РАЗБИТЫ."

     PRINT AT 4,16;"ВЫ НАШЛИ МЕЧ!"

     STONE=-1
     SWORD=1

     PAUSE

     GOTO 2000


3000 REM ============================================
     REM ТЁМНЫЙ ЛЕС
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 1,1;"ТЁМНЫЙ ЛЕС"

     REM ДЕРЕВО

     INK 48

     PCIRCLE 150,65,40
     PCIRCLE 115,80,35
     PCIRCLE 185,85,35

     INK 192

     LINE 150,95,150,190

     REM ЩИТ

     IF SHIELD THEN GOTO 3100

     INK 255

     TRIANGLE 145,75,165,75,155,105


3100 REM ============================================
     REM ГЕРОЙ
     REM ============================================

     X=235
     Y=165

     GOSUB 10000


3200 REM ============================================
     REM ТЕКСТ ЛЕСА
     REM ============================================

     INK 255

     IF SHIELD THEN GOTO 3300

     PRINT AT 2,5;"ВЫСОКО НА ДЕРЕВЕ"
     PRINT AT 2,7;"ВИСИТ ЩИТ"

     GOTO 3400


3300 PRINT AT 3,5;"У ВАС ЕСТЬ ЩИТ"


3400 REM ============================================
     REM МЕНЮ ЛЕСА
     REM ============================================

     PRINT AT 2,24;"ПОЙТИ НА ПОЛЯНУ"
     PRINT AT 2,26;"ПОЙТИ ДАЛЬШЕ ЧЕРЕЗ ЛЕС"

     IF SHIELD=0 THEN PRINT AT 2,28;"ДОСТАТЬ ЩИТ"

     PAUSE

     Y=TOUCHY

     IF Y>=192 AND Y<208 THEN GOTO 1000

     IF Y>=208 AND Y<224 THEN GOTO 5000

     IF SHIELD=0 AND Y>=224 AND Y<240 THEN GOTO 3500

     GOTO 3000


3500 REM ============================================
     REM ДОСТАТЬ ЩИТ
     REM ============================================

     IF STONE>0 THEN GOTO 3600

     PAPER 0
     INK 255
     CLS

     PRINT AT 4,12;"НЕ ПОЛУЧАЕТСЯ"

     PAUSE

     GOTO 3000


3600 REM ============================================
     REM ЩИТ ПОЛУЧЕН
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 4,10;"БАЦ!"

     PRINT AT 3,13;"ЩИТ УПАЛ С ДЕРЕВА."

     PRINT AT 4,16;"ТЕПЕРЬ ОН ВАШ."

     STONE=-1
     SHIELD=1

     PAUSE

     GOTO 3000


4000 REM ============================================
     REM ДРЕВНИЕ РУИНЫ
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 1,1;"ДРЕВНИЕ РУИНЫ"

     REM РУИНЫ

     INK 192

     LINE 50,180,50,110
     LINE 50,110,90,110
     LINE 90,110,90,180

     LINE 110,180,110,130
     LINE 110,130,150,130

     REM ГОЛЕМ

     INK 255

     PCIRCLE 220,110,18

     LINE 220,128,220,165

     LINE 220,140,195,155
     LINE 220,140,245,155

     LINE 220,165,205,185
     LINE 220,165,235,185

     PRINT AT 3,5;"РУИНЫ ОХРАНЯЕТ ГОЛЕМ"


4100 REM ============================================
     REM МЕНЮ РУИН
     REM ============================================

     PRINT AT 3,23;"ОТСТУПИТЬ"
     PRINT AT 3,25;"АТАКОВАТЬ ГОЛЕМА"
     PRINT AT 3,27;"ПОГОВОРИТЬ С ХРАНИТЕЛЕМ"

     PAUSE

     Y=TOUCHY

     IF Y>=184 AND Y<200 THEN GOTO 1000

     IF Y>=200 AND Y<216 THEN GOTO 4200

     IF Y>=216 AND Y<232 THEN GOTO 4300

     GOTO 4000


4200 REM ============================================
     REM АТАКА ГОЛЕМА
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 2,10;"БАДА-БУМС!!!"

     PRINT AT 1,13;"ГОЛЕМ РАСПЛЮЩИЛ ВАС"

     PRINT AT 2,15;"ОДНИМ УДАРОМ!"

     PAUSE

     GOTO 500


4300 REM ============================================
     REM РАЗГОВОР С ГОЛЕМОМ
     REM ============================================

     IF SWORD AND SHIELD AND TALISMAN=1 THEN GOTO 4500

     PAPER 0
     INK 255
     CLS

     PRINT AT 2,10;"ТЫ НЕ ПОХОЖ"

     PRINT AT 3,12;"НА РЫЦАРЯ!!!"

     PRINT AT 2,15;"ГОЛЕМ ПНУЛ ВАС"

     PRINT AT 1,17;"И ВЫ УЛЕТЕЛИ!"

     PAUSE

     GOTO 1000


4500 REM ============================================
     REM ГЕРОЙ ПРОШЁЛ
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 2,10;"ТЫ ПОХОЖ НА РЫЦАРЯ!"

     PRINT AT 1,13;"ПОЙДИ И ВОЗЬМИ"

     PRINT AT 2,15;"РЕЛИКВИЮ!!!"

     PAUSE

     GOTO 4600


4600 REM ============================================
     REM ТАЛИСМАН ОРДЕНА
     REM ============================================

     PAPER 0
     INK 255
     CLS

     PRINT AT 4,10;"ВЫ НАШЛИ"

     PRINT AT 4,13;"ТАЛИСМАН ОРДЕНА!"

     TALISMAN=2

     PAUSE

     GOTO 1000


5000 REM ============================================
REM ДЕРЕВНЯ
REM ============================================

PAPER 0
INK 255
CLS

PRINT AT 1,1;"ДЕРЕВНЯ"

REM ДОМИКИ

INK 192
LINE 20,140,20,190
LINE 20,140,70,140
LINE 70,140,70,190
TRIANGLE 15,140,45,110,75,140

LINE 110,150,110,190
LINE 110,150,170,150
LINE 170,150,170,190
TRIANGLE 105,150,140,115,175,150

LINE 220,135,220,190
LINE 220,135,280,135
LINE 280,135,280,190
TRIANGLE 215,135,250,100,285,135

REM ДВЕРИ

INK 48
LINE 40,190,40,165
LINE 40,165,55,165
LINE 55,165,55,190

LINE 135,190,135,165
LINE 135,165,150,165
LINE 150,165,150,190

LINE 242,190,242,160
LINE 242,160,258,160
LINE 258,160,258,190


REM ЛАВКА

INK 255
LINE 80,170,120,170
LINE 85,170,85,185
LINE 115,170,115,185


REM СТАРОСТА СИДИТ

CIRCLE 100,145,8
LINE 100,153,100,165
LINE 100,158,92,168
LINE 100,158,108,168
LINE 100,165,92,170
LINE 100,165,108,170


REM ГЕРОЙ

GOSUB 10000


REM ТЕКСТ

INK 255
PRINT AT 1,4;"В ДЕРЕВНЕ ПОЧТИ НЕ ОСТАЛОСЬ"
PRINT AT 1,5;"ЛЮДЕЙ. ВСЕ БОЯТСЯ ГОЛЕМА."
PRINT AT 1,7;"НО СТАРОСТА РАД ВАМ И ХОЧЕТ"
PRINT AT 1,8;"ПОЗНАКОМИТЬ С ВНУЧКОЙ."


INK 48
PRINT AT 2,25;"ПОЗНАКОМИТЬСЯ С ВНУЧКОЙ"


INK 255
PRINT AT 2,27;"ВЕРНУТЬСЯ НА ПОЛЯНУ"

PRINT AT 2,29;"ИДТИ МИМО СТАРОСТЫ"


PAUSE
Y=TOUCHY


REM ЗНАКОМСТВО

IF Y>=184 AND Y<200 THEN GOTO 5500


REM ПОЛЯНА

IF Y>=200 AND Y<216 THEN GOTO 1000


REM СТАРЫЙ МОСТ

IF Y>=216 AND Y<240 THEN GOTO 6000


GOTO 5000



5500 REM ============================================
REM КОНЦОВКА - ЖЕНИТЬБА
REM ============================================

PAPER 0
INK 255
CLS


REM ДОМИК

INK 192
LINE 30,110,30,190
LINE 30,110,110,110
LINE 110,110,110,190
TRIANGLE 20,110,70,70,120,110


REM ДВЕРЬ

INK 48
LINE 60,190,60,150
LINE 60,150,85,150
LINE 85,150,85,190


REM ЯБЛОНЯ

INK 48
LINE 200,190,200,125

INK 192
PCIRCLE 180,110,25
PCIRCLE 210,100,30
PCIRCLE 235,120,25


REM ЯБЛОКИ

INK 255
PCIRCLE 185,100,4
PCIRCLE 210,90,4
PCIRCLE 225,115,4
PCIRCLE 200,125,4
PCIRCLE 240,130,4


REM ГЕРОЙ

GOSUB 10000


REM ЖЕНА

CIRCLE 150,145,8
LINE 150,153,150,165
TRIANGLE 135,190,165,190,150,165

REM СИСЬКИ )))

PCIRCLE 144,163,4
PCIRCLE 156,163,4


REM ДЕТИ И ВНУКИ

CIRCLE 125,180,4
LINE 125,184,125,193

CIRCLE 135,175,4
LINE 135,179,135,190

CIRCLE 165,178,4
LINE 165,182,165,193

CIRCLE 175,175,4
LINE 175,179,175,190

CIRCLE 115,185,3
LINE 115,188,115,195

CIRCLE 185,185,3
LINE 185,188,185,195

CIRCLE 95,180,4
LINE 95,184,95,194

CIRCLE 205,180,4
LINE 205,184,205,194

CIRCLE 105,190,3
LINE 105,193,105,198

CIRCLE 195,190,3
LINE 195,193,195,198


INK 255

PRINT AT 1,3;"ВЫ ПОЖЕНИЛИСЬ И ПРОЖИЛИ"
PRINT AT 1,4;"ДОЛГУЮ СЧАСТЛИВУЮ ЖИЗНЬ"
PRINT AT 1,5;"В ОКРУЖЕНИИ ДЕТЕЙ И ВНУКОВ."


PRINT AT 10,14;"КОНЕЦ ИГРЫ"
PRINT AT 7,28;"КОСНИСЬ ДЛЯ ВЫХОДА"

PAUSE
END

REM СБРОС И НОВАЯ ИГРА

STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100


6000 REM ============================================
REM СТАРЫЙ МОСТ
REM ============================================

PAPER 0
INK 255
CLS

PRINT AT 1,1;"СТАРЫЙ МОСТ"

REM ТЕКСТ

PRINT AT 1,3;"СТАРЫЙ МОСТ ГОТОВ РУХНУТЬ"


REM РЕКА

INK 48
LINE 0,145,320,145
LINE 0,180,320,180

LINE 0,155,40,150
LINE 40,150,80,158
LINE 80,158,120,150
LINE 120,150,160,158
LINE 160,158,200,150
LINE 200,150,240,158
LINE 240,158,280,150
LINE 280,150,320,158


REM БЕРЕГА

INK 192
LINE 0,135,90,145
LINE 230,145,320,135


REM СТАРЫЙ КРИВОЙ МОСТ

INK 255

LINE 70,135,110,125
LINE 110,125,150,140
LINE 150,140,190,120
LINE 190,120,240,135

LINE 70,145,110,135
LINE 110,135,150,150
LINE 150,150,190,130
LINE 190,130,240,145


REM ДОСКИ МОСТА

LINE 90,130,90,140
LINE 115,128,115,138
LINE 140,136,140,148
LINE 165,130,165,143
LINE 195,125,195,135
LINE 220,130,220,140


REM ГЕРОЙ

GOSUB 10000


REM МЕНЮ

INK 48
PRINT AT 2,24;"ПОЙТИ В ДЕРЕВНЮ"

INK 255
PRINT AT 2,26;"ПЕРЕЙТИ ЧЕРЕЗ МОСТ"

INK 192
PRINT AT 2,28;"ПЕРЕЙТИ РЕКУ ВБРОД"


PAUSE
Y=TOUCHY


REM В ДЕРЕВНЮ

IF Y>=184 AND Y<200 THEN GOTO 5000


REM НА МОСТ

IF Y>=200 AND Y<216 THEN GOTO 6500


REM ВБРОД

IF Y>=216 AND Y<232 THEN GOTO 8000


GOTO 6000



6500 REM ============================================
REM МОСТ РУХНУЛ
REM ============================================

PAPER 0
INK 255
CLS

PRINT AT 1,1;"СТАРЫЙ МОСТ"


REM РЕКА

INK 48
LINE 0,150,320,150
LINE 0,190,320,190


REM ОБЛОМКИ

INK 192

LINE 70,100,130,190
LINE 100,120,170,190
LINE 150,90,220,190
LINE 210,110,270,190


REM ГЕРОЙ ПРИДАВЛЕН )))

INK 255

CIRCLE 160,180,8
LINE 150,190,175,190


PRINT AT 1,3;"КРРРРАКС!!!"
PRINT AT 1,5;"МОСТ РУХНУЛ И ВАС ПРИДАВИЛО"
PRINT AT 1,6;"ОБЛОМКАМИ!"


PRINT AT 7,15;"КОНЕЦ ИГРЫ"


PAUSE


REM СБРОС И НОВАЯ ИГРА

STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100


8000 REM ============================================
REM БОЛОТО
REM ============================================

PAPER 0
INK 255
CLS

PRINT AT 1,1;"БОЛОТО"

PRINT AT 1,3;"ТЕЧЕНИЕ ПОДХВАТИЛО ВАС И"
PRINT AT 1,4;"УНЕСЛО НА БОЛОТО!!!"

PRINT AT 1,6;"НА КОЧКЕ СИДИТ ОГРОМНАЯ ЖАБА,"
PRINT AT 1,7;"А НА БЕРЕГУ ВАЛЯЮТСЯ КАМНИ"


REM ============================================
REM КАМЫШИ
REM ============================================

INK 48

LINE 10,190,10,145
LINE 18,190,22,135
LINE 28,190,28,150
LINE 38,190,43,140

LINE 275,190,275,145
LINE 285,190,290,135
LINE 295,190,295,150
LINE 305,190,310,140


REM ============================================
REM КОЧКА
REM ============================================

INK 192

PCIRCLE 160,170,48


REM ============================================
REM ЖАБА
REM ============================================

INK 48

PCIRCLE 160,145,24
PCIRCLE 137,160,16
PCIRCLE 183,160,16


REM ГЛАЗА

INK 255

PCIRCLE 150,137,6
PCIRCLE 170,137,6

INK 0

PCIRCLE 150,137,2
PCIRCLE 170,137,2


REM РОТ

LINE 145,155,175,155


REM ============================================
REM КАМНИ
REM ============================================

INK 192
PCIRCLE 35,180,5

INK 48
PCIRCLE 55,174,4

INK 255
PCIRCLE 75,182,6

INK 128
PCIRCLE 98,176,5

INK 192
PCIRCLE 118,184,4


REM ============================================
REM ГЕРОЙ
REM ============================================

GOSUB 10000


REM ============================================
REM ИНТЕРФЕЙС
REM ============================================

INK 255

PRINT AT 2,24;"АТАКОВАТЬ ЖАБУ"


REM --------------------------------------------
REM КАМНЯ НЕТ
REM --------------------------------------------

IF STONE<1 THEN PRINT AT 2,26;"ПОДНЯТЬ КАМЕНЬ"


REM --------------------------------------------
REM КАМЕНЬ ЕСТЬ
REM ПЕРВЫЙ ТАЛИСМАН ЕЩЁ НЕ ВЗЯТ
REM --------------------------------------------

IF STONE=1 AND TALISMAN=0 THEN PRINT AT 2,26;"ЧТО-ТО БЛЕСТИТ МЕЖДУ КАМНЯМИ"


REM ============================================
REM ОЖИДАНИЕ ВЫБОРА
REM ============================================

PAUSE

Y=TOUCHY


REM ============================================
REM АТАКА ЖАБЫ
REM ============================================

IF Y>=184 AND Y<200 THEN GOTO 8400


REM ============================================
REM ПОДНЯТЬ КАМЕНЬ
REM ============================================

IF Y>=200 AND Y<216 AND STONE<1 THEN GOTO 8500


REM ============================================
REM ВЗЯТЬ ТАЛИСМАН
REM ============================================

IF Y>=200 AND Y<216 AND STONE=1 AND TALISMAN=0 THEN GOTO 8600


GOTO 8000



8400 REM ============================================
REM АТАКА ЖАБЫ
REM ============================================
CLS

REM МЕЧ И ЩИТ

IF SWORD=1 AND SHIELD=1 THEN GOTO 8700


REM ТОЛЬКО МЕЧ

IF SWORD=1 AND SHIELD=0 THEN GOTO 8800


REM ТОЛЬКО ЩИТ

IF SWORD=0 AND SHIELD=1 THEN GOTO 8900


REM НИЧЕГО НЕТ

IF SWORD=0 AND SHIELD=0 THEN GOTO 8950


GOTO 8000



8500 REM ============================================
REM ПОДНЯТЬ КАМЕНЬ
REM ============================================

STONE=1

CLS

PRINT AT 1,10;"ВЫ ПОДНЯЛИ КАМЕНЬ."

PAUSE

GOTO 8000



8600 REM ============================================
REM ПЕРВЫЙ ТАЛИСМАН
REM ============================================

CLS

TALISMAN=TALISMAN+1

PRINT AT 1,10;"МЕЖДУ КАМНЯМИ БЛЕСТИТ"
PRINT AT 1,11;"ЖАБИЙ ТАЛИСМАН!"

PAUSE

GOTO 8000



8700 REM ============================================
REM МЕЧ И ЩИТ
REM ============================================

PRINT AT 1,10;"ВЫ НАБРОСИЛИСЬ НА ЖАБУ"
PRINT AT 1,11;"С МЕЧОМ И ЩИТОМ."

PRINT AT 1,13;"ОНА УСКАКАЛА В НЕИЗВЕСТНОМ"
PRINT AT 1,14;"НАПРАВЛЕНИИ."

PRINT AT 1,16;"А ВЫ ПЕРЕШЛИ ПО КОЧКАМ."

PAUSE

GOTO 9000



8800 REM ============================================
REM ТОЛЬКО МЕЧ
REM ============================================

PRINT AT 1,10;"ВЫ ПОРАЗИЛИ ЖАБУ МЕЧОМ,"

PRINT AT 1,12;"НО ОНА ОТБРОСИЛА ВАС"
PRINT AT 1,13;"ДАЛЕКО."

PAUSE

GOTO 6000



8900 REM ============================================
REM ТОЛЬКО ЩИТ
REM ============================================

PRINT AT 1,10;"ВЫ ТОЛКНУЛИ ЖАБУ ЩИТОМ,"

PRINT AT 1,12;"НО ОНА ТОЛКНУЛА ВАС"
PRINT AT 1,13;"СИЛЬНЕЕ."

PAUSE

GOTO 4000



8950 REM ============================================
REM ЖАБА СЪЕЛА ГЕРОЯ
REM ============================================

CLS

PRINT AT 1,10;"НЯМ-НЯМ!"

PRINT AT 1,12;"ЖАБА ПРОГЛОТИЛА ВАС!!!"

PRINT AT 7,28;"КОНЕЦ ИГРЫ"

PAUSE


REM СБРОС ИГРЫ

STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



9000 REM ============================================
REM ЗЛОВЕЩАЯ БАШНЯ
REM ============================================

PAPER 0
INK 255
CLS


REM ============================================
REM ТУЧИ
REM ============================================

INK 128

PCIRCLE 30,35,18
PCIRCLE 55,32,22
PCIRCLE 80,38,18

PCIRCLE 230,35,18
PCIRCLE 255,30,22
PCIRCLE 285,38,20


REM ============================================
REM БАШНЯ
REM ============================================

INK 128

LINE 35,190,35,75
LINE 115,190,115,75

LINE 35,75,115,75


REM КРЫША

LINE 25,75,75,35
LINE 75,35,125,75


REM ОКНО

INK 255

PCIRCLE 75,110,12


REM ДВЕРЬ

LINE 60,190,60,155
LINE 90,155,90,190


REM ============================================
REM СТОЛ
REM ============================================

INK 192

LINE 130,180,245,180

LINE 145,180,145,205
LINE 230,180,230,205


REM ============================================
REM ЧАЙНИК
REM ============================================

INK 255

PCIRCLE 185,165,12

LINE 197,165,210,165

LINE 175,153,185,145


REM ============================================
REM ДЕМОН
REM ============================================

INK 48


REM ГОЛОВА

PCIRCLE 250,125,16


REM РОГА

TRIANGLE 240,115,232,95,248,110
TRIANGLE 260,115,268,95,252,110


REM ТЕЛО

LINE 250,141,250,175


REM РУКИ

LINE 250,150,230,165
LINE 250,150,270,160


REM НОГИ

LINE 250,175,240,195
LINE 250,175,260,195


REM ============================================
REM ТОПОР
REM ============================================

INK 255

LINE 230,165,215,135

TRIANGLE 205,135,225,130,215,150


REM ============================================
REM ГЕРОЙ
REM ============================================

GOSUB 10000




REM ============================================
REM ИНТЕРФЕЙС
REM ============================================

INK 255

PRINT AT 1,1;"ЗЛОВЕЩАЯ БАШНЯ"

PRINT AT 1,3;"РОГАТЫЙ ДЕМОН С ТОПОРОМ"
PRINT AT 1,4;"ПРИСМАТРИВАЕТСЯ К ВАМ И ГОВОРИТ:"

PRINT AT 1,6;"У ТЕБЯ ЩИТ И МЕЧ КАК У РЫЦАРЯ..."

PRINT AT 1,8;"ХОЧЕШЬ ЧАЮ?"

PRINT AT 2,24;"АТАКОВАТЬ ДЕМОНА"

PRINT AT 2,26;"ДАВАЙ! Я ЛЮБЛЮ ЧАЙ!"

PRINT AT 2,28;"ЛУЧШЕ КОФЕ!"


PAUSE

Y=TOUCHY


REM ============================================
REM АТАКА
REM ============================================

IF Y>=184 AND Y<200 THEN GOTO 9100


REM ============================================
REM ЧАЙ
REM ============================================

IF Y>=200 AND Y<216 THEN GOTO 9200


REM ============================================
REM КОФЕ
REM ============================================

IF Y>=216 AND Y<232 THEN GOTO 9500


GOTO 9000



9100 REM ============================================
REM АТАКА ДЕМОНА
REM ============================================

CLS

PRINT AT 1,5;"ХЕРАКС!!!!!"

PRINT AT 1,8;"ДЕМОН БЬЁТ ВАС ТОПОРОМ!!!"

PRINT AT 1,11;"ВЫ УМЕРЛИ!"

PRINT AT 7,28;"КОНЕЦ ИГРЫ"

PAUSE


STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



9200 REM ============================================
REM ПЬЁМ ЧАЙ
REM ============================================


REM НЕТ ТАЛИСМАНОВ

IF TALISMAN=0 THEN GOTO 9300


REM ОДИН ТАЛИСМАН

IF TALISMAN=1 THEN GOTO 9400


REM ДВА ТАЛИСМАНА

IF TALISMAN=2 THEN GOTO 9450


GOTO 9300



9300 REM ============================================
REM ЯД И ПРОКЛЯТИЕ
REM ============================================

CLS

PRINT AT 1,5;"БУУУЭЭЭЭЭЭЭЭЭЭ!"

PRINT AT 1,8;"ВЫ УМЕРЛИ ОТ ЯДА"

PRINT AT 1,9;"И ПРОКЛЯТИЯ!"

PRINT AT 7,28;"КОНЕЦ ИГРЫ"

PAUSE


STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



9400 REM ============================================
REM ТАЛИСМАН ЖАБЫ
REM ============================================

CLS

PRINT AT 1,5;"АААААРГХЭЭЭЭПС!"

PRINT AT 1,8;"АМУЛЕТ ЖАБЫ СПАС ОТ ЯДА,"

PRINT AT 1,10;"НО ПРОКЛЯТИЕ УБИЛО ВАС!"

PRINT AT 7,28;"КОНЕЦ ИГРЫ"

PAUSE


STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



9450 REM ============================================
REM ДРУГ ДЕМОНА
REM ============================================

CLS

PRINT AT 1,3;"ТЫ ПОХОЖ НА МОЕГО"

PRINT AT 1,4;"СТАРОГО ДРУГА!"

PRINT AT 1,7;"ВОЗЬМИ ЕГО ТАЛИСМАН!"


REM ДЕМОНЫ

INK 48

PCIRCLE 110,135,20
PCIRCLE 210,135,20


REM РОГА

TRIANGLE 100,125,92,105,108,120
TRIANGLE 120,125,128,105,112,120

TRIANGLE 200,125,192,105,208,120
TRIANGLE 220,125,228,105,212,120


REM ТЕЛА

LINE 110,155,110,195
LINE 210,155,210,195


REM РУКИ

LINE 110,165,135,175
LINE 210,165,185,175


REM ТАЛИСМАН

INK 192

PCIRCLE 160,150,12


INK 255

PRINT AT 1,21;"ВЫ ПРЕВРАЩАЕТЕСЬ В ДЕМОНА!"

PRINT AT 1,23;"И ВМЕСТЕ ПРАВИТЕ МИРОМ!!!"

PRINT AT 10,26;"КОНЕЦ ИГРЫ"
PRINT AT 7,28;"КОСНИСЬ ДЛЯ ВЫХОДА"
PAUSE

END
STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



9500 REM ============================================
REM ЛУЧШЕ КОФЕ
REM ============================================


REM МЕНЬШЕ ДВУХ ТАЛИСМАНОВ

IF TALISMAN<2 THEN GOTO 9600


REM ДВА ТАЛИСМАНА

IF TALISMAN=2 THEN GOTO 9700


GOTO 9600



9600 REM ============================================
REM ДЕМОН ВЫКИНУЛ ГЕРОЯ
REM ============================================

CLS

PRINT AT 1,5;"ДЕМОН ОБАЛДЕЛ ОТ НАГЛОСТИ"

PRINT AT 1,7;"И ВЫКИНУЛ ВАС В ДЕРЕВНЮ!"

PAUSE

GOTO 5000



9700 REM ============================================
REM ШУТ ДЕМОНА
REM ============================================

CLS

PRINT AT 1,3;"А ТЫ НАГЛЕЦ!"

PRINT AT 1,5;"БУДЕШЬ МОИМ ШУТОМ!"


REM ТРОН

INK 192

LINE 215,160,215,110
LINE 275,110,275,160

LINE 215,110,225,90
LINE 225,90,235,110

LINE 255,110,265,90
LINE 265,90,275,110


REM ДЕМОН

INK 48

PCIRCLE 245,135,18

TRIANGLE 235,125,227,105,243,120
TRIANGLE 255,125,263,105,247,120


REM ШУТ

INK 255

PCIRCLE 120,155,12

LINE 120,167,120,195

LINE 120,175,100,185
LINE 120,175,140,185

LINE 120,195,110,210
LINE 120,195,130,210


REM КОЛПАК

INK 192

TRIANGLE 108,145,120,125,132,145


INK 255

PRINT AT 1,22;"И ВЫ ЖИЛИ НЕДОЛГО,"

PRINT AT 1,23;"НО ВЕСЕЛО!"

PRINT AT 10,26;"КОНЕЦ ИГРЫ"
PRINT AT 7,28;"КОСНИСЬ ДЛЯ ВЫХОДА"
PAUSE
END

STONE=0
SWORD=0
SHIELD=0
TALISMAN=0

GOTO 100



10000 REM ============================================
      REM ОБЩАЯ ОТРИСОВКА ГЕРОЯ
      REM X,Y - НОГИ ГЕРОЯ
      REM ============================================

IF Y<80 THEN Y=80
IF Y>220 THEN Y=220

      INK 255

      CIRCLE X,Y-35,10

      LINE X,Y-25,X,Y

      LINE X,Y-20,X-10,Y-10
      LINE X,Y-20,X+10,Y-10

      LINE X,Y,X-8,Y+15
      LINE X,Y,X+8,Y+15

      REM КАМЕНЬ

      IF STONE<=0 THEN GOTO 10100

      PCIRCLE X-10,Y-10,6


10100 REM ============================================
      REM МЕЧ
      REM ============================================

      IF SWORD=0 THEN GOTO 10200

      LINE X+10,Y-10,X+25,Y-30
      LINE X+15,Y-20,X+25,Y-20


10200 REM ============================================
      REM ЩИТ
      REM ============================================

      IF SHIELD=0 THEN GOTO 10300

      TRIANGLE X-15,Y-15,X-5,Y,X-15,Y+5


10300 RETURN